src/cf/src/Catalogs/ТелеграмСервис/ТелеграмСервис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТелеграмСервис</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ТелеграмСтатусыИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>Бот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВходящегоОбновления</name>
    <type>
      <types>EnumRef.ТелеграмВидыВходящихОбновлений</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийТекстАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборыУсловийАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкиАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВходящийТекст</name>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ТелеграмВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВходящиеДанные</name>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ТелеграмВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыУсловий</name>
    <attributes>
      <name>НаборУсловий</name>
      <type>
        <types>CatalogRef.ТелеграмНаборУсловий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обработки</name>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.ТелеграмОбработка</types>
      </type>
    </attributes>
    <attributes>
      <name>НаборУсловий</name>
      <type>
        <types>CatalogRef.ТелеграмНаборУсловий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Enums/ТелеграмВидыВходящихОбновлений/ТелеграмВидыВходящихОбновлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТелеграмВидыВходящихОбновлений</name>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>ОтветКонтекстнойКлавиатуры</name>
    <comment>CallbackQuery</comment>
  </enumValues>
  <enumValues>
    <name>ВстроенныйЗапрос</name>
  </enumValues>
  <enumValues>
    <name>ВыбранныйЛинейныйРезультат</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ТелеграмСервис/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидВходящегоОбновленияПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.СтраницаВходящийТекст.Видимость = Объект.ВидВходящегоОбновления = ПредопределенноеЗначение("Перечисление.ТелеграмВидыВходящихОбновлений.Сообщение");
	Элементы.СтраницаВходящиеДанные.Видимость = Объект.ВидВходящегоОбновления = ПредопределенноеЗначение("Перечисление.ТелеграмВидыВходящихОбновлений.ОтветКонтекстнойКлавиатуры");
	
КонецПроцедуры

#КонецОбласти
